/**
 * 
 * 21 - Что такое функция
 * Функция это блок кода, который можно выполнять многократно
 */

let a = 5
let b = 3
function sum(a, b) {
    const c = a + b
    console.log(c)
}

sum(a, b) // 8

a = 8
b = 12

sum(a, b) // 20

// Функция позволяет действие с разными вводными значениями, многократно.
/**
 * Функция может быть...
 * ... именнованной
 * ... присвоена переменной
 * ... анонимной 
 * ... аргументом при вызове другой функции
 * ... згначением свойства (метода) объекта
 * 
 * Функция это объект
 * 
 */

function myFn(a, b) {
    let c
    a = a + 1
    c = a + b
    return c
}
console.dir(myFn)
