// 8 Практика по объявлению переменных
const myName = 'Yuriy'
console.log(myName);
// ОШИБКА - Missing initializer in const declaration - нельзя объявить переменную с помощью const не пресвоив ей значение


// 9. Примитивные типы — тип переменной определяется типом присвоенного значения
const a = 10 //значение типа число
const b = 'abc' // значение типа строка

// ТИПЫ
// Приметивные типы и Ссылочный тип
// переменная => имеет значение => значение имеет ТИП

// Приметивные типы
// string — "" строка
// boolean - логический — 2 значения true/false
// number — число
// null — есть только одно значение null — используем тогда когда хотим показать чо значение отсутствует
// undefined — значение не определено
// symbol — 


// 10. Ссылочный тип это объект, называется ссылочным так как при присваивании такого объекта переменной, переменная не хранит сам объект, она хнанит ссылку на объект
// object — это набор свойств и каждое свойство состоит из названия и значения свойства

const objectA {
    a: 10,
    b: true
}
const copyOfA = objectA
copyOfA = 20 // objectA => 20


// 11. Динамическая типизация
// JS - динамически типизируемый язык

