// Раздел 2: Самое важное в JavaScript

// Выражения | Функции | Объекты
// Все сущности в Javaskript это - объекты
// Объект — набор свойств «Имя: значение»



// Что такое — console.log  
//  console - это объект
//  . точка это синтаксис кот наз точечная запись, с помощью точечно записи можно получать доступ к свойствам объекта
//  log - это метод, метод это функция, которая является значением одного из свойств объекта
// () скобки это вызов метода 
// 'Hello World' — это аргумент, значчение типа строка 
console.log('Hello World');
console.dir(''); // отображает все свойства объекта
console.table(''); // Отображает все свойства объекта в табличном виде

 
// Выражение — любое выражение всегда возвращает значение
// Примеры
// 'abc'
// 10
// 5+2
// c = 10
// 'Good' + 'Evening'
// a <= b || c !== d
// myFunction(c, d)
