// Раздел 2: Самое важное в JavaScript

// Выражения | Функции | Объекты
// Все сущности в Javaskript это - объекты
// Объект — набор свойств «Имя: значение»



// Что такое — console.log  
//  console - это объект
//  . точка это синтаксис кот наз точечная запись, с помощью точечно записи можно получать доступ к свойствам объекта
//  log - это метод, метод это функция, которая является значением одного из свойств объекта
// () скобки это вызов метода 
// 'Hello World' — это аргумент, значчение типа строка 
console.log('Hello World');
console.dir(''); // отображает все свойства объекта
console.table(''); // Отображает все свойства объекта в табличном виде

 
// Выражение — любое выражение всегда возвращает значение
// Примеры
// 'abc' результат будет та же строка - abc
// 10 результат будет число - 10 
// 5+2 результатом будет  7 так как используется оператор +
// c = 10 оператор присвоения результат 10
// 'Good' + 'Evening'
// a <= b || c !== d это выражение которое возвращает значение // true или false
 myFunction(c, d) // результат функции

a = 206,
console.log('Good' +' ' + 'Evening');
// Результатом каждого выражения является значение.

// Выражение присваивания 
a = 20

//Выражение с побочными действиями. Не только возвращает значение, но и выполняет другие действия.
a = 5 // используем оператор присваивания и возвращает значение
b++ // оператор ++ увеличивает значение на еденицу
myFunction(c, d) // вызов функции в которой мы можем выполнять различные действия

